##### import pandas as pd
import numpy as np

# ![](https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png) Intro to SQL
Week 5 | Day 4

### LEARNING OBJECTIVES
*After this lesson, you will be able to:*
- Connect to a local or remote database using Python or Pandas
- Connect to a local or remote database using SQLite Manager (for SQLite) or PG Admin (for POSTGRES)
- Perform queries using SELECT
- Perform simple aggregations COUNT, MAX/MIN/SUM

We have seen how to connect to a local sqlite database and to a remote postgresql database.

**Check:** What SQL operations have we learned so far?


- CREATE
- INSERT
- DELETE
- UPDATE
- SELECT

**Check:** What differences between commands have we seen for SQLite and PostgreSQL?

- how to list schema and tables

## SQLite

SQLite is an embedded SQL database engine. Unlike most other SQL databases, SQLite does not have a separate server process. **SQLite reads and writes directly to ordinary disk files.** A complete SQL database with multiple tables, indices, triggers, and views, is contained in a single disk file.

SQLite is not directly comparable to client/server SQL database engines such as MySQL, Oracle, PostgreSQL, or SQL Server since SQLite is trying to solve a different problem.

SQLite emphasizes economy, efficiency, reliability, independence, and simplicity.

**SQLite does not compete with client/server databases. SQLite competes with fopen().**

## Interacting with SQLite from Python (30 min)

**The sqlite3 package**

The command line utility can be useful for basic SQL tasks, but since we're using python for the rest of code it will often be easier to access sqlite directly from within python. We can use the python sqlite3 package for just this purpose.

Open a connection to an SQLite database file. As before, if the file does not already exist it will automatically be created.

## Let's connect to our db file with SQLite

In [2]:
import sqlite3
sqlite_db = 'dsi-db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

## Now we'll create a table using our cursor

In [3]:
c.execute('CREATE TABLE houses \
          (field1 INTEGER PRIMARY KEY, sqft INTEGER,\
           bdrms INTEGER, age INTEGER, price INTEGER);')

# Save (commit) the changes
conn.commit()

## Now, we'll add rows to our table

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection. In particular, the cursor's execute() method supports value substitution using the ? character, which makes adding multiple records a bit easier.

In [4]:
last_sale = (None, 4000, 5, 22, 619000)

# execute for one entry
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)', last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python None value, rather than NULL, to trigger SQLite to auto-increment the Primary Key.

## We can bring up DB Browser to see our results...

## Now let's bulk add mulitple rows with executemany()

In [5]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# executemany for multiple
c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

## Let's see what it looks like in DB Browser

## Now, we'll bulk add using a csv

In [6]:
pd.read_csv('./datasets/housing-data.csv')\
           .head(2)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900

In [7]:
# check that our entries match
c.execute('PRAGMA table_info(houses)')
c.fetchall()

[(0, u'field1', u'INTEGER', 0, None, 1),
 (1, u'sqft', u'INTEGER', 0, None, 0),
 (2, u'bdrms', u'INTEGER', 0, None, 0),
 (3, u'age', u'INTEGER', 0, None, 0),
 (4, u'price', u'INTEGER', 0, None, 0)]

In [8]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists
data = (genfromtxt('./datasets/housing-data.csv',\
                   dtype='i8', delimiter=',', skip_header=1)).tolist()

## Here we see what that looks like

In [9]:
data[0:3]

[[2104, 3, 70, 399900], [1600, 3, 28, 329900], [2400, 3, 44, 369000]]

## To auto-increment the PK, we need 'None', so we'll add that

In [10]:
# append a None value to beginning of each sub-list
for d in data:
    d.insert(0, None)

## Here we see that result

In [11]:
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

## Now we'll loop through and add each

In [12]:
# loop through data, running an INSERT on each record (i.e. sublist)
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

## Again, we can see the results with DB Broswer

## We can also see our efforts with a query

In [13]:
# Similar syntax as before
results = c.execute("SELECT * FROM houses WHERE bdrms = 4")

# Here results is a cursor object - use fetchall() to extract a list
results.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

## We could also have added those records with executemany()

In [20]:
new_list = []
for line in data:
    new_list.append((line[0], line[1], line[2], line[3], line[4]))

In [23]:
new_list[:3]

[(None, 2104, 3, 70, 399900),
 (None, 1600, 3, 28, 329900),
 (None, 2400, 3, 44, 369000)]

In [22]:
# c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', new_list)

# conn.commit()

## Using pandas

While databases provide many analytical capabilities, often it's useful to pull the data back into Python for more flexible programming. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.



Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

In [15]:
import pandas as pd
from pandas.io import sql

In [16]:
data = pd.read_csv('./datasets/housing-data.csv')
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

## Now we'll use the pandas .to_sql() method to write another table

In [17]:
# this creates a table
data.to_sql('houses_pandas',
            con=conn,
            if_exists='replace',
            index=False)

## Again, we can see our table using SQLite browser

## And we can query to read it

In [18]:
# input the query plus the connection
sql.read_sql('select * from houses_pandas limit 5', con=conn)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

## Exercise

- Create a new database file using SQLite
- Create a table in that db file called students
- Add a column for their name, their favorite color and number
- Insert the names of all the people sitting at your table
- Create the table with a auto-incrementing primary key
- Once the table is populated use pandas to select all the data from the table

In [19]:
# solution - create db

sqlite_db2 = 'student-db-new.sqlite'
conn2 = sqlite3.connect(sqlite_db2)
c2 = conn2.cursor()

In [20]:
# solution - create table

c2.execute('CREATE TABLE students \
          (field1 INTEGER PRIMARY KEY, name TEXT, fav_color TEXT, \
          fav_num INTEGER);')

# Save (commit) the changes
conn2.commit()

In [21]:
# solution - populate table

students_here = [
  (None, 'Rocky', 'Red', 7),
  (None, 'Balu','Blue', 11),
  (None, 'Amber', 'Yellow', 3),
]

c2.executemany('INSERT INTO students VALUES (?, ?, ?, ?)', students_here)

conn2.commit()

In [22]:
# solution - query with pandas

pd.read_sql('select * from students', con=conn2)

   field1   name fav_color  fav_num
0       1  Rocky       Red        7
1       2   Balu      Blue       11
2       3  Amber    Yellow        3

## SQL Operators

## SELECT

```SQL
SELECT
<columns>
FROM
<table>
```

## Now within pandas

In [23]:
sql.read_sql('select * from houses_pandas limit 10', con=conn)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900
5  1985      4   61  299900
6  1534      3   12  314900
7  1427      3   57  198999
8  1380      3   14  212000
9  1494      3   15  242500

```SQL
SELECT *
```
denotes returns all of the columns.

### We can also select individual columns

```SQL
SELECT
<col1>, <col2>, <coln>
FROM
<table>
```

## And with pandas...

In [25]:
sql.read_sql('select age, price from houses_pandas limit 10', con=conn)

   age   price
0   70  399900
1   28  329900
2   44  369000
3   49  232000
4   75  539900
5   61  299900
6   12  314900
7   57  198999
8   14  212000
9   15  242500

## Exercise

- Write a query that returns only bedrooms, sq. footage, and price from our houses_pandas table
- Implement the query in pandas

## solution

```SQL
SELECT bdrms, sqft, price
FROM houses_pandas
LIMIT 10
```

In [26]:
# solution

sql.read_sql('select bdrms, sqft, price from houses_pandas limit 10',\
             con=conn)

   bdrms  sqft   price
0      3  2104  399900
1      3  1600  329900
2      3  2400  369000
3      2  1416  232000
4      4  3000  539900
5      4  1985  299900
6      3  1534  314900
7      3  1427  198999
8      3  1380  212000
9      3  1494  242500

## WHERE

### Where is used to filter the data

```SQL
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```

### Example in SQL

```SQL
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 500000;
```

## Now, we'll execute it in pandas

In [28]:
sql.read_sql('select sqft, bdrms, age, price from houses_pandas\
             where bdrms = 2 and price < 500000', con=conn)

   sqft  bdrms  age   price
0  1416      2   49  232000
1  1320      2   62  299900
2  1888      2   79  255000
3  1839      2   40  349900
4  1664      2   40  368500
5   852      2   70  179900

## Exercise

- Write a query that returns the sqft, bdrms, age for  houses older than 60 years.
- Implement the query in pandas

## solution

```SQL
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

In [29]:
sql.read_sql('select sqft, bdrms, age from houses_pandas where age > 60', con=conn)

    sqft  bdrms  age
0   2104      3   70
1   3000      4   75
2   1985      4   61
3   2300      4   77
4   1320      2   62
5   1236      3   78
6   1888      2   79
7   2040      4   75
8   3137      3   67
9   4215      4   66
10  1200      3   76
11   852      2   70
12  1852      4   64

## AGGREGATIONS



- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

## Example SQL

```SQL
SELECT COUNT(price)
FROM houses_pandas;
```

In [30]:
sql.read_sql('SELECT COUNT(price) FROM houses_pandas', con=conn)

   COUNT(price)
0            47

## Another example

```SQL
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

In [31]:
sql.read_sql('SELECT AVG(sqft), MIN(price), \
MAX(price) FROM houses_pandas WHERE bdrms = 2', con=conn)

   AVG(sqft)  MIN(price)  MAX(price)
0     1496.5      179900      368500

## Exercise 

- Write a query to find the average price per sq ft for one bedroom houses
- Write another to find the average price per sq ft for those greater than 3 bedrooms
- Implement both in pandas sql

## solution

```SQL
SELECT SUM(price)/SUM(sqft)
FROM houses_pandas
WHERE bdrms = 1;
```

## solution

```SQL
SELECT SUM(price)/SUM(sqft)
FROM houses_pandas
WHERE bdrms > 3;
```

In [32]:
sql.read_sql('SELECT SUM(price)/SUM(sqft) FROM houses_pandas WHERE bdrms = 1', con=conn)

   SUM(price)/SUM(sqft)
0                   169

In [33]:
sql.read_sql('SELECT SUM(price)/SUM(sqft) FROM houses_pandas WHERE bdrms > 3', con=conn)

   SUM(price)/SUM(sqft)
0                   157

## Independent Practice

Practice querying the database and answer the below questions.  You have a few options:
- work in DB Browser
- work in pandas 
- use the PostgreSQL database using PG Admin.  If you haven't already, you would need to set up a connection to the remote server:

```
hostname: dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com
port: 5432
user: dsi_student
password: gastudents

database: dsi
table: housing
```

Questions:

- What's the average price for 1 bedroom apartments?
- What's the average price per room for 2 bedrooms apartments?
- How old is the oldest 3 bedrooms apartment?
- How old is the youngest apartment?
- What's the average age for the whole dataset?
- What's the average age for each bedroom size? (hint: if you're using sql/pandas,  want to use a for loop, have a look at .format() for string manipulation)

Try to answer all these in SQL.

If you finish, try completing the first sections of <br>[PostgreSQL Exercises](https://pgexercises.com/questions/basic/selectall.html)<br>[SQL zoo](http://www.sqlzoo.net/).

In [45]:
## What's the average price per room for 1 bedroom apartments?
sql.read_sql('SELECT AVG(price) FROM houses_pandas WHERE bdrms = 1', con=conn)

   AVG(price)
0    169900.0

In [49]:
# What's the average price per room for 2 bedrooms apartments?
sql.read_sql('SELECT AVG(price)/2 FROM houses_pandas WHERE bdrms = 2', con=conn)

    AVG(price)/2
0  140433.333333

In [52]:
# How old is the oldest 3 bedrooms apartment?
sql.read_sql('SELECT MAX(age) FROM houses_pandas WHERE bdrms = 3', con=conn)

   MAX(age)
0        78

In [53]:
# How old is the youngest apartment?
sql.read_sql('SELECT MIN(age) FROM houses_pandas', con=conn)

   MIN(age)
0         5

In [54]:
# What's the average age for the whole dataset?
sql.read_sql('SELECT AVG(age) FROM houses_pandas', con=conn)

    AVG(age)
0  42.744681

In [61]:
# What's the average age for each bedroom size?
for i in range(1,6):
    sql_query = "SELECT AVG(age) FROM houses_pandas WHERE bdrms = {}".format(i)
    print "for {} bedrooms, the average age is {}".format(i,sql.read_sql(sql_query,con=conn))

for 1 bedrooms, the average age is    AVG(age)
0       5.0
for 2 bedrooms, the average age is     AVG(age)
0  56.666667
for 3 bedrooms, the average age is    AVG(age)
0     38.36
for 4 bedrooms, the average age is     AVG(age)
0  46.857143
for 5 bedrooms, the average age is    AVG(age)
0      49.0

## Conclusion

- We've seen how to use a SQL database and a SQLite file database to make queries
- We've seen how to create a table and populate it
- We've seen how to use pandas sql to make queries
- We've seen how to use select, where, and aggregations